app/views/sessions/new.html.erb

SELECT  "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "Barbara1"], ["LIMIT", 1]]
---
  <label>Name: </label>
  <%= select_tag :user_name, options_for_select(User.all.collect {|p| [p.name, p.name]}), :disabled => false, :include_blank => "Please select your username from this dropdown" %><br>