app/views/houses/show.html.erb

<p>Max guests: <%=@house.max_guests%></p>
<% if @house.reviews.count !=0 %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."house_id" = ?  [["house_id", 1]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."house_id" = ?  [["house_id", 1]]