app/controllers/houses_controller.rb

INSERT INTO "houses" ("name", "price_per_night", "city", "max_guests", "pets_allowed", "owner_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Great summer palace"], ["price_per_night", 100], ["city", "South Lake Tahoe"], ["max_guests", 10], ["pets_allowed", "t"], ["owner_id", 13]]
---
  def create
    @house = House.create(house_params)

UPDATE "houses" SET "price_per_night" = ?, "pets_allowed" = ? WHERE "houses"."id" = ?  [["price_per_night", 200], ["pets_allowed", "f"], ["id", 10]]
---
  def update
    @house = House.find(params[:id])
    if @house.update_attributes(house_params)

DELETE FROM "houses" WHERE "houses"."id" = ?  [["id", 10]]
---
  def destroy
    @house = House.find(params[:id])
    @house.destroy