app/controllers/reviews_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
  def show
    if params[:user_id]
      @user = User.find_by_id(params[:user_id])
      @review = Review.find_by(id: params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
---
  def index
    if params[:user_id]
      binding.pry
      @user = User.find_by_id(params[:user_id])

INSERT INTO "reviews" ("cleanliness_rating", "location_rating", "value_rating", "comments", "house_id", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["cleanliness_rating", 1], ["location_rating", 3], ["value_rating", 4], ["comments", "Nice room"], ["house_id", 1], ["user_id", 12]]
---
  def create
    @review = Review.new(review_params)
    if @review.save