app/controllers/sessions_controller.rb

  def new
    @non_oauth_users = User.select{|p| !p.uid}
---
SELECT "users".* FROM "users"

  def create
    @user = User.find_by(:name => params[:user_name])
    if @user && @user.authenticate(params[:password])
      session[:user_id] = @user.id
      redirect_to user_path(@user)
    elsif !@user && @user = User.find_or_create_by(:uid => auth['uid']) do |u|
---
SELECT  "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "1"], ["LIMIT", 1]]
INSERT INTO "users" ("name", "password_digest") VALUES (?, ?)  [["name", "Barbara Choy"], ["password_digest", "$2a$10$4XoupO9KmNV/1AJjS3VnSejmEHrH3J6Ym2xsXIYXJrgTAfmM5sZcm"]]
SELECT  "users".* FROM "users" WHERE "users"."uid" = ? LIMIT ?  [["uid", "10156880517010605"], ["LIMIT", 1]]