app/controllers/stays_controller.rb

  def create
    @stay = Stay.create(:guest_id => params[:guest_id], :house_id => params[:house_id])
---
INSERT INTO "stays" ("guest_id", "house_id") VALUES (?, ?)  [["guest_id", "23"], ["house_id", "1"]]