app/controllers/users_controller.rb

  def create
    @user = User.create(name: params[:user][:name],
        password: params[:user][:password],
        owner: params[:user][:owner])
---
INSERT INTO "users" ("name", "password_digest", "balance", "guests", "pets", "owner") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Barbara"], ["password_digest", "$2a$10$6D8bf7pOSEUmg5mfKFZQBOlufmN9gB9M663j.a6p8uFAsTur/VbwG"], ["balance", 500], ["guests", 5], ["pets", "t"], ["owner", nil]]

  def show
    redirect_to '/' unless current_user
    @message = params[:message]
    @house = params[:house]
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "users" SET "email" = ?, "balance" = ?, "guests" = ?, "pets" = ? WHERE "users"."id" = ?  [["email", "mary@mary.com"], ["balance", 1000], ["guests", 5], ["pets", "t"], ["id", 15]]